import numpy as np


PCSS_COLORMAP = [
    [0, 0, 0],           # 图像 没有看到
    [0, 0, 0],           # 其他
    [128, 0, 0],         # 围栏
    [128, 64, 64],       # 墙
    [128, 128, 128],     # 建筑
    [0, 128, 0],         # 植被
    [255, 255, 0],       # 道路标线
    [128, 128, 0],       # 道路
    [192, 192, 192],     # 人行道
    [255, 128, 0],       # 杆
    [255, 0, 0],         # 交通灯
    [255, 0, 255],       # 交通标志
    [255, 192, 203],     # 人
    [0, 0, 255],         # 汽车
    [0, 64, 128],        # 卡车
    [0, 255, 0],         # 自行车
    [0, 255, 128],       # 摩托车
    [128, 128, 255],     # 电力线
    [0, 128, 128],       # 电线杆
    [192, 128, 0],       # 路灯
    [255, 255, 128],     # 广告牌
    [64, 64, 64],        # 井盖
    [192, 64, 0],        # 桥
    [64, 0, 128],        # 隧道
    [128, 0, 255],       # 路沿
    [64, 128, 128],      # 路侧挡块
    [128, 64, 0],        # 路中挡块
    [192, 0, 128],       # 护栏
    [0, 192, 64],        # 非机动车道
    [0, 128, 64],        # 服务车道
    [128, 192, 0],       # 道路隔离带
    [128, 0, 128],       # 垃圾桶
    [0, 0, 128],         # 集水池
    [64, 0, 64],         # 接线盒
    [0, 64, 64],         # 闭路电视摄像机
    [255, 64, 64],       # 消防栓
    [128, 128, 64],      # 长凳
    [0, 192, 192],       # 电话亭
]


PCSS_CLASS_NAMES = [
    "无",
    "其他",
    "围栏",
    "墙",
    "建筑",
    "植被",
    "道路标线",
    "道路",
    "人行道",
    "杆",
    "交通灯",   # 10
    "交通标志",
    "人",
    "汽车",
    "卡车",
    "自行车",
    "摩托车",
    "电力线",
    "电线杆",
    "路灯",
    "广告牌",   # 20
    "井盖",
    "桥",
    "隧道",
    "路沿",
    "路侧挡块",
    "路中挡块",
    "护栏",
    "非机动车道",
    "服务车道",
    "道路隔离带",   # 30
    "垃圾桶",
    "集水池",
    "接线盒",
    "闭路电视摄像机",
    "消防栓",
    "长凳",
    "电话亭",   # 37
]


def color_mapping(color_indices, colormap):
    colormap = np.array(colormap).astype(np.uint8)
    colors = colormap[color_indices]
    
    return colors


def mapping_func(x, mapping_dict):
    label = mapping_dict.get(x, None)
    if label is None:
        return 1
    else:
        return label

pc_label_map = {'nan': 0, '其他数字': 1, 13: 2, 12: 3, 11: 4, 21: 5, 45: 6, 7: 7, 8: 8, 17: 9, 19: 10, 20: 11, 24: 12, 26: 13, 27: 14, 33: 15, 32: 16, 46: 17, -1: 37}
img_label_map = {-1: 17, 54: 2, 55: 3, 92: 5, 63: 6, 46: 7, 49: 8, 5: 10, 16: 11, 32: 13, 33: 14, 34: 15, 35: 16, 2: 18, 4: 19, 6: 21, 67: 22, 68: 23, 47: 25, 48: 26, 66: 27, 59: 28, 60: 29, 52: 30, 9: 31, 7: 32, 27: 33, 28: 34, 10: 35, 11: 36, 31: 37, 77: 4, 69: 4, 1: 9, 3: 9, 78: 12, 79: 12, 80: 12, 81: 12, 19: 20, 13: 20, 53: 24, 56: 24, 0: 0} 
vectorized_mapping_func = np.vectorize(mapping_func)